Show / Hide Table of Contents
Enum ConnectorGridType
Defines a type of fasteners grid.
Namespace: IdeaRS.OpenModel.Parameters
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum ConnectorGridType
Fields
 Name |  Description
 FirstShifted
First shifted.
 FirstShiftedFull
First row is shifted.
 FirstShiftedShort
First row is shifted, second row is short.
 Full
Rows are full.
 Regular
Regular type of grid.
 SecondShifted
Second shifted.
 SecondShiftedFull
Second row is shifted
 SecondShiftedShort
Second row is shifted, first is short.
 Short
Rows are short.
 Improve this Doc
 View Source